Revit 2027 API
ZoneEquipmentData.AirSystemId Property
 The air system used for this zone equipment, if applicable.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId AirSystemId { get; set; }
Public Property AirSystemId As ElementId
	Get
	Set
public:
property ElementId^ AirSystemId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member AirSystemId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ZoneEquipmentData Class
Autodesk.Revit.DB.Mechanical Namespace